{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Rajiv&#39;s first 11ty Blog Attempt",
  "language": "en",
  "home_page_url": "https://dev.to/rajivthummalapsu/generating-a-docker-file-for-your-nasa-image-search-repo-100l",
  "feed_url": "https://dev.to/rajivthummalapsu/generating-a-docker-file-for-your-nasa-image-search-repo-100l/feed/feed.json",
  "description": "I am writing about my experiences as a naval navel-gazer.",
  "author": {
    "name": "Rajiv Thummala",
    "url": "https://example.com/about-me/"
  },
  "items": [{
      "id": "https://dev.to/baseBlogAttempt1/posts/thirdpost/",
      "url": "https://dev.to/baseBlogAttempt1/posts/thirdpost/",
      "title": "Generating a Docker File for your NASA Image Search Repo",
      "content_html": "<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/t2kuu6bmcqr4975els0h.png\" alt=\"Image description\" /></p>\n<p>First started in 2013, Docker is a set of platform as a service products that leverage OS-level virtualization to deliver software in containers.</p>\n<p>Containers make it easy to put new versions of software, with new business features, into production quickly-and to quickly roll back to a previous version if you need to. A form of virtualization, one single container can be utilized to run anything from a small microservice or software process to a larger application. Inside a container are all the necessary executables, binary code, libraries, and configuration files. Thus, docker is so powerful due to its ability to facilitate the microservice deployment process by leveraging containers to run across different computing environments.</p>\n<hr />\n<p>To begin, lets ensure that you have a rudimentary understanding of how docker functions. Please run through <a href=\"https://www.docker.com/play-with-docker\">this tutorial</a> if you are not familiar with docker.</p>\n<p>If you are not running through the tutorial, ensure that you have your own server through Docker. If you are stuck on this, please run through the aforementioned tutorial.</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/uxuec84i6jwn9ka0ltkq.png\" alt=\"Your screen should like like this\" /></p>\n<p>The NASA Image Search Repository already has some adequate functionality. Leveraging microservices, the application can be deployed in a non-taxing way that does not increase in complexity as it is transferred between computing environments. However, there is one way to optimize this deployment: containers. Docker will help us integrate our microservices into containers and will consequently avoid becoming a monolithic application.</p>\n<p><strong>Setup</strong></p>\n<p>Create ADD NEW INSTANCE in the Docker Playground. Run the following command in the new instance console.<br />\n<code>git clone https://github.com/IST402-Group-E/ip project/blob/master/src/Nasa.js &amp;&amp; cd Nasa.js</code></p>\n<p><strong>Configure</strong></p>\n<p>Before we ran any Docker commands, we need to configure our custom settings for this application. These settings will be an API key and the url of your Play With Docker instance.</p>\n<p>Run the following command to set up a fresh copy of your environment settings.</p>\n<p><code>cp dot.env.example dot.env</code></p>\n<p>What we just done is created a new file called dot.env. Following the configuration as code principle, we are going to add our applications custom settings via environment variables. Docker relies on this pattern to ensure the application thats running inside of it is stateless.</p>\n<p>Now we need to populate those settings.</p>\n<p>Select the EDITOR button in your docker lab (it is to the right of the orange DELETE button)</p>\n<p>Now we need to obtain our api key, which will be our unique password for requesting a new query. Head over to <a href=\"http://api.nasa.gov/\">api.nasa.gov</a> to signup and generate an api key for NASA Image search.</p>\n<p>Obtain this key and then insert it into dot.env (replace it with XXXXXXX)</p>\n<p>Now select open port in docker<br />\nType 4000 into the prompt and click &quot;Ok&quot;.</p>\n<p>You should see a new page that is blank since there is no running application yet. COPY the url that blank page. That's were our server will be accessible when we get this thing running.</p>\n<p>Now that we have the public url we can add it to our dot.env and click &quot;Save&quot;</p>\n<p>Now just head over to docker and start up the application</p>\n<p>Run the following command in your terminal: docker-compose-up. Select port 80 to view our application!</p>\n",
      "date_published": "2022-02-23T00:00:00Z"
    },{
      "id": "https://dev.to/baseBlogAttempt1/posts/secondpost/",
      "url": "https://dev.to/baseBlogAttempt1/posts/secondpost/",
      "title": "Feeding IP addresses into the API of GeoIP to Obtain Geographic Coordinates (Lat/Long)",
      "content_html": "<p>This will be a brief synopsis and run through on how latitude and longitude coordinates can be detected via GeoIP. Particularly, by feeding IP addresses into the GeoIP API. You can follow along with my <a href=\"https://github.com/RajivThummala-psu/ip-project/blob/master/src/LocationFromIP.js\">github repo</a>.</p>\n<p>Before we get started, let's import the necessary dependencies within your project. Since we are going to be wiring up the data to a wikipedia-query tag, we will need to import the following dependency: @lrnwebcomponents/wikipedia-query/wikipedia-query.js</p>\n<p><em>Make sure you are using the right syntax</em></p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/r8ycv2suy22w095bxten.png\" alt=\"Image description\" /></p>\n<p>To complete the setup process we will also need to do npm install @lrnwebcomponents/wikipedia-query</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/csmpiw6tqrlsky52cf0y.png\" alt=\"Image description\" /></p>\n<p>As you parse through the constructor repo, you will notice that the first API you run into is: <strong><a href=\"https://freegeoip.app/json/\">https://freegeoip.app/json/</a></strong></p>\n<p>This is the GeoIP API. Unfortunately, at the time of this writing, the server is down so I am unable to provide an overview of all the services this API offers in particular. However, you can head over to this link to poke around.</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vyob9fdinxuv9lscbl5k.png\" alt=\"Image description\" /></p>\n<p><strong>Deciphering the GeoIP API?</strong><br />\n<img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/s433cvg4apylswqwr78k.png\" alt=\"Image description\" /></p>\n<p>You will notice that the geoip is set to the locationEndpoint.</p>\n<p>An endpoint, as adumbrated by <a href=\"https://smartbear.com/learn/performance-monitoring/api-endpoints/#:~:text=Each%20endpoint%20is%20the%20location,to%20carry%20out%20their%20function.&amp;text=The%20place%20that%20APIs%20send,lives%2C%20is%20called%20an%20endpoint.\">smartbear.com</a>, enables</p>\n<blockquote>\n<p>APIs to transfer vital information, processes, transactions, and more. API usage will only increase as time goes on, and making sure that each touchpoint in API communication is intact is vital to the success of each API. Endpoints specify where resources can be accessed by APIs and play a key role in guaranteeing the correct functioning of the software that interacts with it.  In short, API performance relies on its ability to communicate effectively with API Endpoints.</p>\n</blockquote>\n<p>Thus, this will serve as an endpoint in which the GeoAPI will retrieve information regarding the client's location to carry out an operation.</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/fcs1fkmabm1x55j3lrhg.png\" alt=\"Image description\" /></p>\n<p>You will also notice that GeoIP is referenced in the async getGeoIPData() method. Let's take some time to pick apart what is going on here.</p>\n<p>`async getGEOIPData() {<br />\nconst IPClass = new UserIP();<br />\nconst userIPData = await IPClass.updateUserIP();<br />\nreturn fetch(this.locationEndpoint + userIPData.ip)<br />\n.then(resp =&gt; {<br />\nif (resp.ok) {<br />\nreturn resp.json();<br />\n}<br />\nreturn false;<br />\n})<br />\n.then(data =&gt; {</p>\n<pre><code>    console.log(data);\n    this.state = data.region_name; //avoided making the same mistake as last time (reminder --&gt; region name)\n    this.city = data.city;\n    this.location = `${data.city}, ${data.state}`;\n    this.lat = data.latitude; \n    this.long = data.longitude;\n\n    console.log(`Your coordinates: ${this.lat} ${this.long}`);\n    return data;\n  });`\n</code></pre>\n<p>To make it easier, lets split this up into 2 parts to get a better understanding: Obtain information from the API &amp; Feed into LitElement based web component to provide stateful updating of the DOM</p>\n<p><strong>Obtain information from the API</strong></p>\n<p>Lets begin by taking a look at this segment:</p>\n<p><code>async getGEOIPData() {     const IPClass = new UserIP();     const userIPData = await IPClass.updateUserIP();     return fetch(this.locationEndpoint + userIPData.ip)       .then(resp =&gt; {         if (resp.ok) {           return resp.json();         }         return false;       })</code></p>\n<p>The fetch command in particular should strike you as new if you have not worked with this language much. It was for me atleast. However, you will quickly learn from a google search that it works similar to the throw and catch commands from java.</p>\n<p>What is happening here is that the program is essentially throwing out a mandatory request for the program to provide information regarding the location endpoint, which we instantiated in the constructor. If the program does not get a response, it will catch it (through returning false in this case). As stated earlier, the location endpoint serves as a checkpoint for the API to retrieve information regarding the client's location.</p>\n<p>What you will notice also is that &quot;userIPData.ip&quot; is also being fetched. Lets take a look at this further. You can follow along in my repo if that is easier!</p>\n<p>`async updateUserIP() {<br />\nreturn fetch(this.ipLookUp)<br />\n.then(resp =&gt; {<br />\nif (resp.ok) {<br />\nreturn resp.json();<br />\n}<br />\nreturn false;<br />\n})<br />\n.then(data =&gt; {<br />\nthis.ip = data.ip;<br />\nthis.cityYouAreIn = data.city;<br />\nthis.countryYouAreIn = data.country;</p>\n<pre><code>    this.location = `${data.city}, ${data.country}`;\n\n    // this.location = &quot;Your location is: &quot; + data.cityYouAreIn+ &quot;, &quot; + data.countryYouAreIn; //understood that the data. references the getproperties method\n    return data;\n  });\n</code></pre>\n<p>}`</p>\n<p>We will notice here that the updateUserIP method is being used to retrieve information regarding the user's ip address and listing readable info regarding their whereabouts (city &amp; country). It is also fetching ipLookUP (<a href=\"https://ip-fast.com/api/ip/?format=json&amp;location=True\">https://ip-fast.com/api/ip/?format=json&amp;location=True</a>), which can be found in the constructor in this file.</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/oa1uuy43jdvn5qx14amy.png\" alt=\"Image description\" /></p>\n<p>ipLookup references an API called ip-fast. ip-fast is an API that analyzes the client's network activity to approximate their location. In case of error, it will return false to catch.</p>\n<p>Both of these API's are thus added together to obtain the geoIPdata. Therefore, what we essentially have here in the async getGEOIPData() method enables us to leverage 2 APIs to retrieve the information that we need. But what do we do now that the data has been fetched?</p>\n<p><strong>Feed into LitElement based web component to provide stateful updating of the DOM</strong></p>\n<p>`  })<br />\n.then(data =&gt; {</p>\n<pre><code>    this.state = data.region_name; //avoided making the same mistake as last time (reminder --&gt; region name)\n    this.city = data.city;\n    this.location = `${data.city}, ${data.state}`;\n    this.lat = data.latitude; \n    this.long = data.longitude;\n\n    console.log(`Your coordinates: ${this.lat} ${this.long}`);\n    return data;\n  });`\n</code></pre>\n<p>Now if we take a look at this second half of the method, we will notice that the data is actually being entered into the console for use. When I first ran into this section of the program, I actually found it quite easy to interpret despite being unfamiliar with this syntax.</p>\n<p>We start of with &quot;then the data&quot;...</p>\n<p>Is used to retrieve information regarding the client's state. You must call for state through region_name as opposed to just data.state (don't make the same mistake I did). Next you can see that the city and location are retrieved. We also add both latitude and longitude into our instances so that we can obtain the geographical coordinates. Ensure that you are doing data.latitude and data.longitude NOT data.lat and data.long.</p>\n<p>These instances are then simply fed into the console.</p>\n<p><code>console.log(</code>Your coordinates: ${this.lat} ${this.long}<code>);         return data;</code></p>\n<p>From here, all you have to do is render. I referenced <a href=\"https://codepen.io/btopro/pen/yLNmVbw\">btopro's codepen</a> to do this, as you can see in my repo.</p>\n<p>After copious efforts getting all the bugs out of my code, I am close to getting an accurate solution. I will continue to update the repo as I optimize the program.</p>\n<p>As you can see, leveraging public API's to perform functions are seamless and potent. There are a multitude of micro services across the web that can be utilized to achieve a goal in a non-taxing manner.</p>\n<p>NASA Rendering in particular is a great one, which provides the ability to render images from NASA by leveraging their <a href=\"https://api.nasa.gov/api.html#apod\">public api</a>. This enables individuals that are not affiliated with NASA to easily access this large stack of information with ease.</p>\n<p>As highlighted by <a href=\"https://wilsjame.github.io/how-to-nasa/\">wilsjame</a>, these are just some of the <a href=\"https://api.nasa.gov/api.html#apod\">many APIs</a> that can be used:</p>\n<ul>\n<li>\n<p>Near Earth Object Web Service (NeoWs): Access to near Earth asteroid information.</p>\n</li>\n<li>\n<p>Earth Polychromatic Imaging Camera (EPIC): Full disc imagery of the Earth.</p>\n</li>\n<li>\n<p>Earth Observatory Natural Event Tracker (EONET): Prototype web service providing continuously updated natural event metadata, such as storm imagery, gathered from the Earth’s surface.<br />\nNASA Image and Video Library: Access to the NASA Image and Video Library.</p>\n</li>\n<li>\n<p>Sounds (beta): Access to space sounds via SoundClound with some of the hassle abstracted away.</p>\n</li>\n<li>\n<p>NASA rendering; render images from NASA using their public API to render the data</p>\n</li>\n</ul>\n<p>Good luck on your attempt and I thank you for taking your time to read this post.</p>\n",
      "date_published": "2022-01-30T00:00:00Z"
    },{
      "id": "https://dev.to/baseBlogAttempt1/posts/firstpost/",
      "url": "https://dev.to/baseBlogAttempt1/posts/firstpost/",
      "title": "An introduction to open-wc",
      "content_html": "<p>Upon dipping your feet into the behemoth that is web development, you will quickly realize how non-static this field is. Everything is constantly changing and evolving, from updates to web protocols to constant syntax alterations. Consequently, a 1337 developer must periodically update their toolkit with the new fads and revolutions within the industry.</p>\n<p>With a sector that is never static, it is vital that the fundamentals of web development are mastered to provide a base in expanding a developer's toolkit. Perhaps one of the most important fundamentals to grasp is the basics of JavaScript. As adumbrated by tutorialspoint:</p>\n<blockquote>\n<p>Javascript is the most popular programming language in the world and that makes it a programmer’s great choice. Once you learnt Javascript, it helps you developing great front-end as well as back-end softwares using different Javascript based frameworks like jQuery, Node.JS etc. Javascript is everywhere, it comes installed on every modern web browser and so to learn Javascript you really do not need any special environment setup. For example Chrome, Mozilla Firefox , Safari and every browser you know as of today, supports Javascript.Javascript helps you create really beautiful and crazy fast websites. You can develop your website with a console like look and feel and give your users the best Graphical User Experience.</p>\n</blockquote>\n<p>This article will provide a beginners perspective on how to begin to interact with JavaScript and will facilitate the setup process to begin exploring the language.</p>\n<p><strong>NodeJS &amp; NPM</strong></p>\n<p>Our first journey together in the world of JavaScript will begin by installing a software named &quot;NodeJS&quot;. What exactly is NodeJS?</p>\n<blockquote>\n<p>In simple terms, it’s a JavaScript free and open source cross-platform for server-side programming that allows users to build network applications quickly. <a href=\"https://medium.com/@LindaVivah/the-beginners-guide-understanding-node-js-express-js-fundamentals-e15493462be1\">Click here to learn more about NodeJS</a></p>\n</blockquote>\n<p>Follow the listed steps closely and don't hesitate to scour the internet further to diagnose any challenges you encounter.</p>\n<p><strong>1)</strong> Head over to <a href=\"https://nodejs.org/en/\"></a> and select the big green button on the left that reads LTS. In my case, the version is 16.13.2 LTS.</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/acy4bjyhnybk6x2ujpqc.png\" alt=\"Image description\" /></p>\n<p>Once you finish downloading, proceed to the next step.</p>\n<p><strong>2)</strong> Next, hold the windows key + R and type &quot;cmd&quot; in the run box that pops up. You can also type &quot;command prompt&quot; into the search bar in your computer if you prefer. This should open up a black box. This is called the terminal or command prompt.</p>\n<p>Type node-v into your terminal. This will be used to check what version of NodeJS you have downloaded. Moreover, it will be used to check if you have actually downloaded NodeJS.</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/evw47bt1u8jvcv3c1gju.png\" alt=\"You should get something like this\" /></p>\n<p>You should have something like this. The number following the &quot;v&quot; is your version number. (Don't worry if it is different than what I have you may proceed to the next step). If you are encountering issues, head over to YouTube to search for a NodeJS download tutorial.</p>\n<p><strong>3)</strong> Next we are going to make sure that npm downloaded correctly. Npm is a package manner that JavaScript leverages to facilitate the runtime environment.</p>\n<p>Run the command npm-v to see what version of npm you have downloaded. Again, the same thing applies here. Don't worry if the numbers following the v are different than the following image. This indicates your version number. If you do not have npm installed, try running the following commmand in your terminal:</p>\n<p>npm install -g npm</p>\n<p>If you are still running into trouble, head over to YouTube to search for installation tutorials for npm.</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/10lhy60b79hxkwxj0bpb.png\" alt=\"Image description\" /></p>\n<p><strong>Installing ohmyzsh</strong><br />\nNext we will work on installing ohmyzsh. Zsh will aid tremendously in operating the terminal. Head over to <a href=\"https://dev.to/vsalbuq/how-to-install-oh-my-zsh-on-windows-10-home-edition-49g2\"></a> for any extra explanations on the following steps.</p>\n<ol>\n<li>To start, type &quot;windows powershell&quot; into the search bar in your computer.</li>\n</ol>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/x93a14lwcckpj4s8thw6.png\" alt=\"Image description\" /></p>\n<p>Select &quot;run as administrator&quot; as depicted in the image. If you do not have windows powershell, I would advise downloading it from the Microsoft Store. Otherwise, you can try running the following steps from your regular terminal/command prompt.</p>\n<ol start=\"2\">\n<li>Run the following command in windows powershell:</li>\n</ol>\n<p>dism.exe /online /enable-feature /featurename:Microsoft-Windows-Subsystem-Linux /all /norestart</p>\n<ol start=\"3\">\n<li>\n<p>This leads us into our next step which is to install debian. Head over to the microsoft store on your windows machine and search for &quot;debian&quot;. Install the application as depicted in the following image.<br />\n<img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/dbo1mhm13bqdtpfin1yh.png\" alt=\"Image description\" /></p>\n</li>\n<li>\n<p>Next open up debian either through the microsoft store or by searching for it in the search bar.</p>\n</li>\n</ol>\n<p>Run the following commands in order.</p>\n<p>$ sudo apt-get update<br />\n$ sudo apt-get upgrade<br />\n$ sudo apt-get install zsh<br />\n$ zsh<br />\n$ sudo apt-get install curl<br />\nsh -c &quot;$(curl -fsSL <a href=\"https://raw.github.com/ohmyzsh/ohmyzsh/master/tools/install.sh\">https://raw.github.com/ohmyzsh/ohmyzsh/master/tools/install.sh</a>)&quot;</p>\n<ol start=\"5\">\n<li>\n<p>Restart debian and make sure that you see .zsh somewhere in the terminal. This lets you know that you have installed zsh correctly.</p>\n</li>\n<li>\n<p>Next we will be installing the node within zsh.</p>\n</li>\n</ol>\n<p>Understanding how Node works and its primary function is important. As referenced on <a href=\"http://medium.com/\">medium.com</a>,</p>\n<blockquote>\n<p>Node allows you to execute Javascript code outside of the browser, in a computing environment (such as a server or local development environment) rather then a browser environment.</p>\n</blockquote>\n<p>In laymans terms, node essentially enables an individual to execute their code in a sandbox environment. (Without causing any real damage). Think of it like practicing an idea for a painting on a sheet of printer paper before starting on the canvas.</p>\n<p>Run the following command:</p>\n<p>$ sudo apt-get install build-essential</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/u91t9kbyz8ik6mtt095g.png\" alt=\"Image description\" /></p>\n<ol start=\"7\">\n<li>Run the following command:</li>\n</ol>\n<p>curl -o- <a href=\"https://raw.githubusercontent.com/nvm-sh/nvm/v0.35.3/install.sh\">https://raw.githubusercontent.com/nvm-sh/nvm/v0.35.3/install.sh</a> | bash</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/sxhwjmcpojq8nhm0y0x4.png\" alt=\"Image description\" /></p>\n<ol start=\"8\">\n<li>Make sure that you have VSCODE installed before you proceed. If you do not have vscode installed, follow the steps linked in this video and then come back. --&gt; <a href=\"https://www.youtube.com/watch?v=V3o57MU5eoE\"></a></li>\n</ol>\n<p>Run the following command:</p>\n<p>code ~/.zshrc</p>\n<p>This will open up vscode with a file. Click on the .zshrc tab and paste the following code after the last line.</p>\n<p>export NVM_DIR=&quot;$HOME/.nvm&quot;<br />\n[ -s &quot;$NVM_DIR/nvm.sh&quot; ] &amp;&amp; . &quot;$NVM_DIR/nvm.sh&quot;</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/sew4kw6zxfohtk9usi9g.png\" alt=\"Image description\" /></p>\n<p>Save the VSCODE file (Ctrl + S), then exit VSCODE.</p>\n<ol start=\"9\">\n<li>Open up debian and run the following command:</li>\n</ol>\n<p>nvm install --lts<br />\n<img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/k6w7p1c72fsyxrm9bqhd.png\" alt=\"Image description\" /></p>\n<p>Next run this command: nvm use --lts</p>\n<p>Nice Work!</p>\n<p><strong>Starting with open-wc</strong></p>\n<p>Now we will take our first dive into working with open-wc.</p>\n<ol>\n<li>\n<p>Before we get started, you will need to create your github account and a repository. Follow the steps in this <a href=\"https://www.youtube.com/watch?v=QUtk-Uuq9nE\">video </a>then proceed to the next step.</p>\n</li>\n<li>\n<p>Next, you will need to establish a secure, SSH key based handshake with github. Follow the steps in this <a href=\"https://docs.github.com/en/authentication/connecting-to-github-with-ssh\">article </a> to complete this task, then proceed to the next step.</p>\n</li>\n<li>\n<p>Open your terminal (windows key  + r --&gt; type in cmd in run box). Next you will need to navigate your github repo that you created.</p>\n</li>\n</ol>\n<p>Find your github repo in your file explorer and right click the file to copy the path to your clipboard.</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/wphs8dkl3icm74w31mcl.png\" alt=\"Image description\" /></p>\n<p>In your terminal, type cd then paste in the file path.<br />\nThis should change your directory to your github repo that you created.</p>\n<ol start=\"4\">\n<li>In the terminal type npm init @open-wc. Wait for the terminal to complete its processing.</li>\n</ol>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/mcf0ai8ykt9xqxhdoqtn.png\" alt=\"Image description\" /></p>\n<ol start=\"5\">\n<li>You should now see a gui that prompts you with some options.<br />\nNavigate through the UI to select the following options:</li>\n</ol>\n<p>What would you like to do today? &gt;&gt; Scaffold a new project<br />\nWhat would you like to scaffold?&gt;&gt; Web Component<br />\nWhat would you like to add <em>(just click enter)</em> &gt;&gt;<br />\nWould you like to use typescript? &gt;&gt; No</p>\n<p>_for the following option, replace what follows hello-world with whatever you would like _</p>\n<p>What is the tagname of your web component &gt;&gt; hello-world_RajivLab1</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/7nm9jm448nhcgl6ojvj2.png\" alt=\"Image description\" /></p>\n<p>Write the file to disk and install dependencies.</p>\n<ol start=\"6\">\n<li>Follow the instructions in the terminal.<br />\nChange the directory to your web component and then run the following command:</li>\n</ol>\n<p>npm run start</p>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/9lecqublj3pv5k8y0b2m.png\" alt=\"Image description\" /></p>\n<ol start=\"7\">\n<li>A browser should pop up with localhost in the address. Right click this page and click &quot;view page source&quot;</li>\n</ol>\n<p><img src=\"https://dev-to-uploads.s3.amazonaws.com/uploads/articles/u1r3y5j4itpiqyf63zca.png\" alt=\"Image description\" /></p>\n<p>You now have access to the source code of this page.</p>\n<ol start=\"8\">\n<li>\n<p>Now lets go ahead and begin to decipher what this code is asking of us. Right click and select &quot;Save as&quot; to download the page.</p>\n</li>\n<li>\n<p>Drag this downloaded file into vscode so that we can comment on the file and start to decipher what the code is doing.</p>\n</li>\n</ol>\n<p>If this is your first time with JavaScript, start by copy and pasting each line of code into google to try and make sense of it. Leave a comment by typing //your_comment_goes_here to annotate what you believe the code is doing.</p>\n<p>This <a href=\"https://lit.dev/playground/#sample=examples/full-component\">article </a>will help.</p>\n<hr />\n<p>You can access my first ever interaction with this code snippet on my Github which is linked <a href=\"https://github.com/RajivThummala-psu/ist402_lab1/blob/main/localhost.htm\">here</a>. Thank you for reading this article and I wish you good luck on the rest of your JavaScript journey.</p>\n",
      "date_published": "2022-01-17T00:00:00Z"
    },{
      "id": "https://dev.to/baseBlogAttempt1/posts/fourthpost/",
      "url": "https://dev.to/baseBlogAttempt1/posts/fourthpost/",
      "title": "This is my fourth post.",
      "content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<h2 id=\"section-header\" tabindex=\"-1\">Section Header <a class=\"direct-link\" href=\"https://dev.to/baseBlogAttempt1/posts/fourthpost/#section-header\" aria-hidden=\"true\">#</a></h2>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
      "date_published": "2018-09-30T00:00:00Z"
    }
  ]
}
